chat_system_1907077461_actor_description=Alex Artist. An artist.
chat_system_1907077461_snap_11_question=^?^Well, did you bring the gold to purchase my priceless work?
chat_system_1907077461_snap_11_answer_0=^?^King Harl asked mt to tell you that he has no intention of changing the terms of the agreement. And if you disagree, you can leave his island, for some other place in Darion.
chat_system_1907077461_snap_11_answer_1=^?^I haven't yet approached him with the question.
chat_system_1907077461_snap_12_question=^?^Why are you so severe? - So rude!<br>Well, I've thought everything over; I'll let him take the picture. And tell him, that I will always be happy to paint for His Majesty.
chat_system_1907077461_snap_12_answer_0=^?^Now you're talking.
chat_system_1907077461_snap_3_question=^?^What about Decar and the gilt? Do you have it?
chat_system_1907077461_snap_3_answer_0=^?^No, not yet.
chat_system_1907077461_snap_3_answer_1=^?^Yes, I found Decar. But it turned out that you have such a bad reputation that he didn't even want to sell me the gilt. He forced me to collect the ore for him myself. Me, the Royal Treasure Searcher!
chat_system_1907077461_switch_2_header_0=^?^Look at it this way. It's not so terrible as it might seem. The ore is a treasure. There is no loss of honor.<br>What is the result of your dealings with Decar? Have you brought the gilt?
chat_system_1907077461_snap_4_question=^?^1
chat_system_1907077461_snap_4_answer_0=^?^No, I haven't yet collected all the ore. I came to find out if maybe you have some.
chat_system_1907077461_snap_5_question=^?^1
chat_system_1907077461_snap_5_answer_0=^?^Yes, I have the gilt for you. Don't worry, here, take it. And give me the picture.
chat_system_1907077461_snap_8_question=^?^Well... The picture is ready. I have only to do some dabs of gilt. Well... here... that's all. It's a great portrait!<br>You know, Harl has paid me only 5000 gold. But looking at this amazing artwork that I made, I think that 5000 gold is not enough.<br>I want another ten thousand gold for the portrait.
chat_system_1907077461_snap_8_answer_0=^?^Another ten thousand? Have a heart, you greedy paint-dauber! Of course I can ask Harl for more money, but I think it's the height of impudence to behave like this with this royal griffin.
chat_system_1907077461_snap_8_answer_1=^?^Look at it like this. Your work will hang in the castle of the Griffins' King. This is a great credit to any artist. Just don't forget to sign the picture.
chat_system_1907077461_snap_6_question=^?^My picture is PERFECT!<br>And even if you simple people without a spark of talent - even if you cannot understand it, well at least I can see it, and I know that my picture is just priceless!<br>That is why I can't give it to you for less than fifteen thousand gold. Tell this to Harl.
chat_system_1907077461_snap_6_answer_0=^?^Are you sure you want to do this? Aren't you afraid that King Harl will not entrust you to paint any royal pictures anymore? And you will not be able to become a court artist.
chat_system_1907077461_snap_7_question=^?^I don't care! My name will go down in history either way. And who will remember this poor king without my works? In fact, his descendants will remember him only through looking at my pictures.
chat_system_1907077461_snap_7_answer_0=^?^Maybe you are right. Ok, I'll talk to Harl about it.
chat_system_1907077461_snap_9_question=^?^Maybe it is a credit. But a greater credit for him is to possess this portrait.
chat_system_1907077461_snap_9_answer_0=^?^Sure, you are right! And the king will appreciate it, you can believe me.<br>If you observe your previous agreement, then henceforth he will order pictures only from you. And he will recommend you to everybody.
chat_system_1907077461_snap_10_question=^?^Hmm... Maybe you are right. I didn't think about this. There are so few kings in our world. You know, I'll ask for the position of court artist. Hundreds of generations of Griffins will admire my pictures.<br>For the glory that I shall have in the coming centuries, I am ready to give this picture to King Harl for free.<br>Here, I return all advance payment. Take it and give it to His Majesty. Give also my request about the position of court artist.
chat_system_1907077461_snap_10_answer_0=^?^A perfect decision! King Harl will appreciate it!
chat_system_1907077461_snap_0_question=^?^From Harl? Yes... he ordered his portrait. And I have almost finished it.<br>I have only to add a few more details. Just to paint a golden crown and a regal look. But I haven't the necessary decorative gilt, and I can not finish the picture without it.
chat_system_1907077461_snap_0_answer_0=^?^Where can we get this gilt?
chat_system_1907077461_snap_1_question=^?^Dwarves make good gilt. I've always bought it from Decar. But after not seeing eye to eye with dwarves, in the art of sculpture last time I was in the tavern, these bearded dwarves don't want to see me anymore. Maybe you can find Decar and buy his gilt for me?
chat_system_1907077461_snap_1_answer_0=^?^Where can I find this Decar?
chat_system_1907077461_snap_2_question=^?^He is usually either in a tavern or hangs about the entrance to the Creiston Mines. He buys ore and jewelry there.
chat_system_1907077461_snap_2_answer_0=^?^Ok, I'll find him.
